In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
# what are vectorized operations
a=np.array([1,2,3,4])
a*4

array([ 4,  8, 12, 16])

In [3]:
# problem with vectorized operation in vanilla python
s=['cat','mat',None,'rat']
[i.startswith('c') for i in s]
# doesn't work with None and slow bcz of python lists

AttributeError: 'NoneType' object has no attribute 'startswith'

In [4]:
# using pandas
s=pd.Series(['cat','mat',None,'rat'])
# str -> string accessor
s.str.startswith('c')

0     True
1    False
2     None
3    False
dtype: object

In [5]:
tit=pd.read_csv('./datasets/titanic.csv')
tit.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [6]:
tit['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [7]:
tit['Name'].str.upper()

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: object

In [8]:
tit['Name'].str.title()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [9]:
tit['Name'].str.capitalize()

0                                Braund, mr. owen harris
1      Cumings, mrs. john bradley (florence briggs th...
2                                 Heikkinen, miss. laina
3           Futrelle, mrs. jacques heath (lily may peel)
4                               Allen, mr. william henry
                             ...
886                                Montvila, rev. juozas
887                         Graham, miss. margaret edith
888             Johnston, miss. catherine helen "carrie"
889                                Behr, mr. karl howell
890                                  Dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [10]:
tit[tit['Name'].str.len() == tit['Name'].str.len().max()]['Name']
# tit.loc[tit['Name'].str.len().argmax()]['Name']

307    Penasco y Castellana, Mrs. Victor de Satode (M...
Name: Name, dtype: object

In [11]:
# cleans leading and trailing spaces
tit['Name'].str.strip()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [12]:
# tit['Name'].str.split(',').apply(lambda a: a[0])
surname=tit['Name'].str.split(',').str.get(0)
surname

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

In [18]:
# fullname without Mr/Mrs
fullname=tit['Name'].str.split(',').str.get(1).str.split('.')
tit['title']=fullname.str.get(0)
tit['fullname']=fullname.str.get(1)
tit

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title,fullname
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Rev,Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Miss,Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Miss,"Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Mr,Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Mr,Patrick

In [21]:
tit['title']=tit['title'].str.replace('Miss','Mrs')
tit['title'].value_counts()

title
 Mr              517
 Mrs             307
 Master           40
 Dr                7
 Rev               6
 Major             2
 Mlle              2
 Col               2
 Don               1
 Mme               1
 Ms                1
 Lady              1
 Sir               1
 Capt              1
 the Countess      1
 Jonkheer          1
Name: count, dtype: int64

In [32]:
tit[tit['title'].str.contains('M')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title,fullname
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Mrs,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,Mrs,William (Margaret Norton)
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Mrs,Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Mrs,"Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Mr,Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Mr,Patrick

In [39]:
# find fullnames that starts or ends with vowel
tit[tit['fullname'].str.contains('^[^aeiouAEIOU].+[^aeiouAEIOU]$')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title,fullname
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,John Bradley (Florence Briggs Thayer)
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,William Henry
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,Mr,James
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Rev,Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Mrs,Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Mrs,"Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Mr,Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Mr,Patrick

In [49]:
# tit['fullname'].str[0:4]
tit['fullname'].str.slice(0,4)

0       Owe
1       Joh
2       Lai
3       Jac
4       Wil
       ...
886     Juo
887     Mar
888     Cat
889     Kar
890     Pat
Name: fullname, Length: 891, dtype: object

# Datetime

### Timestamp
Oct 24th 2022 at 7:00PM

In [54]:
# creating timestamp
pd.Timestamp('2024-04-17')

Timestamp('2024-04-17 00:00:00')

In [55]:
pd.Timestamp('2024')

Timestamp('2024-01-01 00:00:00')

In [59]:
pd.Timestamp('17th April 2024')

Timestamp('2024-04-17 00:00:00')

In [61]:
pd.Timestamp('2024-04-17 12:59:50')

Timestamp('2024-04-17 12:59:50')

In [62]:
pd.Timestamp('17th April 2024 1:01AM')

Timestamp('2024-04-17 01:01:00')

In [71]:
import datetime as dt
ts=pd.Timestamp(dt.datetime(2024,4,17))
ts

Timestamp('2024-04-17 00:00:00')

In [76]:
ts.day

17

In [86]:
np.array('2024-04-14',dtype=np.datetime64)
np.array('2024-04-14',dtype=np.datetime64) + np.arange(3)

array(['2024-04-14', '2024-04-15', '2024-04-16'], dtype='datetime64[D]')

### DatetimeIndex
Collection of multiple pandas timestamps

In [93]:
dti=pd.DatetimeIndex(['2024-4-1','2024-4-3','2024-4-6'])
dti

DatetimeIndex(['2024-04-01', '2024-04-03', '2024-04-06'], dtype='datetime64[ns]', freq=None)

In [97]:
type(dti[0])

pandas._libs.tslibs.timestamps.Timestamp

In [98]:
pd.DatetimeIndex([ 
    dt.datetime(2024,4,1),
    dt.datetime(2024,4,2),
    dt.datetime(2024,4,1)
])

DatetimeIndex(['2024-04-01', '2024-04-02', '2024-04-01'], dtype='datetime64[ns]', freq=None)

In [99]:
pd.DatetimeIndex([pd.Timestamp('2024-4-1'),pd.Timestamp('2024-4-3'),pd.Timestamp('2024-4-6')])

DatetimeIndex(['2024-04-01', '2024-04-03', '2024-04-06'], dtype='datetime64[ns]', freq=None)

In [101]:
pd.Series([1,2,3],index=dti)

2024-04-01    1
2024-04-03    2
2024-04-06    3
dtype: int64

In [104]:
pd.date_range(start='2024-04-14',end='2024-04-17',freq='D')

DatetimeIndex(['2024-04-14', '2024-04-15', '2024-04-16', '2024-04-17'], dtype='datetime64[ns]', freq='D')

In [111]:
pd.date_range(start='2024-02-14',end='2024-06-17',freq='12D')

DatetimeIndex(['2024-02-14', '2024-02-26', '2024-03-09', '2024-03-21',
               '2024-04-02', '2024-04-14', '2024-04-26', '2024-05-08',
               '2024-05-20', '2024-06-01', '2024-06-13'],
              dtype='datetime64[ns]', freq='12D')

In [113]:
pd.date_range(start='2024-01-14',end='2024-04-14',freq='M')

DatetimeIndex(['2024-01-31', '2024-02-29', '2024-03-31'], dtype='datetime64[ns]', freq='M')

In [117]:
pd.date_range(start='2024-01-14',end='2024-04-14',freq='MS')

DatetimeIndex(['2024-02-01', '2024-03-01', '2024-04-01'], dtype='datetime64[ns]', freq='MS')

In [116]:
pd.date_range(start='2024-04-16',end='2024-04-17',freq='6H')

DatetimeIndex(['2024-04-16 00:00:00', '2024-04-16 06:00:00',
               '2024-04-16 12:00:00', '2024-04-16 18:00:00',
               '2024-04-17 00:00:00'],
              dtype='datetime64[ns]', freq='6H')

In [119]:
pd.date_range(start='2019-01-14',end='2024-04-14',freq='A') # year

DatetimeIndex(['2019-12-31', '2020-12-31', '2021-12-31', '2022-12-31',
               '2023-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [126]:
pd.date_range(start='2024-04-14',periods=3)

DatetimeIndex(['2024-04-14', '2024-04-15', '2024-04-16'], dtype='datetime64[ns]', freq='D')

In [127]:
pd.date_range(start='2024-04-14',periods=3,freq='H')

DatetimeIndex(['2024-04-14 00:00:00', '2024-04-14 01:00:00',
               '2024-04-14 02:00:00'],
              dtype='datetime64[ns]', freq='H')

### to_datetime

In [129]:
dates=pd.Series(['2024-4-1','2024-4-3','2024-4-6'])
dates

0    2024-4-1
1    2024-4-3
2    2024-4-6
dtype: object

In [133]:
pd.to_datetime(dates)

0   2024-04-01
1   2024-04-03
2   2024-04-06
dtype: datetime64[ns]

In [135]:
pd.to_datetime(dates)

0   2024-04-01
1   2024-04-03
2   2024-04-06
dtype: datetime64[ns]

In [134]:
pd.to_datetime(dates).dt.day
# dt -> accessor

0    1
1    3
2    6
dtype: int32

In [136]:
pd.to_datetime(
    pd.Series(['2024-4-1','2024-4-3','2024-200-6'])
)
# error in last month

ValueError: time data "2024-200-6" doesn't match format "%Y-%m-%d", at position 2. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [137]:
pd.to_datetime(
    pd.Series(['2024-4-1','2024-4-3','2024-200-6'])
,errors='coerce')

0   2024-04-01
1   2024-04-03
2          NaT
dtype: datetime64[ns]